-- phpMyAdmin SQL Dump
-- http://www.phpmyadmin.net

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";

--
-- Database: `hackdemo`
--
CREATE DATABASE `hackdemo` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `hackdemo`;

-- --------------------------------------------------------

--
-- Table structure for table `admin`
--

CREATE TABLE IF NOT EXISTS `admin` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `encrypted_password` varchar(255) NOT NULL,
  `company` varchar(255) NOT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 ;

--
-- Dumping data for table `admin`
--

INSERT INTO `admin` (`ID`, `name`, `encrypted_password`, `company`) VALUES
(1, 'user001', '$2y$07$q2TkOUHq5HpCXxU2eXN88eIcaSUr3uPOcwymBPwA/RdC3AEH5x6H6', '制服のマネキン株式会社'),
(2, 'user002', '$2y$07$q2TkOUHq5HpCXxU2eXN88e.3kWTI2UJar4KizGsZx3orHIN8vPX76', '君の名は希望株式会社'),
(3, 'user003', '$2y$07$q2TkOUHq5HpCXxU2eXN88e.7LjRlX5H9utFxwM6654LT6J5UBrBV2', 'バレッタ株式会社'),
(4, 'user004', '$2y$07$q2TkOUHq5HpCXxU2eXN88evXT.lw3BABVRPyMyZLd1StOjBXigMKy', '太陽ノック株式会社');

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE IF NOT EXISTS `user` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `hiragana` varchar(255),
  `birthplace` varchar(255),
  `grade` varchar(255),
  `birthday` date,
  `company` varchar(255) NOT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 ;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`ID`, `name`, `hiragana`, `birthplace`, `grade`, `birthday`, `company`) VALUES
(1, '高山一実', 'たかやま かずみ', '千葉県', '1期', '1994-02-08', '制服のマネキン株式会社'),
(2, '川後陽菜', 'かわご ひな', '長崎県', '1期', '1998-03-22', '制服のマネキン株式会社'),
(3, '相楽伊織', 'さがら いおり', '埼玉県', '2期', '1997-11-26', '制服のマネキン株式会社'),
(4, '樋口日奈', 'ひぐち ひな', '東京都', '1期', '1998-01-31', '制服のマネキン株式会社'),
(5, '西野七瀬', 'にしの ななせ', '大阪府', '1期', '1994-05-25', '制服のマネキン株式会社'),
(6, '秋元真夏', 'あきもと まなつ', '埼玉県', '1期', '1993-08-20', '制服のマネキン株式会社'),
(7, '若月佑美', 'わかつき ゆみ', '静岡県', '1期', '1994-06-27', '制服のマネキン株式会社'),
(8, '中田花奈', 'なかだ かな', '埼玉県', '1期', '1994-08-06', '制服のマネキン株式会社'),
(9, '伊藤かりん', 'いとう かりん', '神奈川県', '2期', '1993-05-26', '制服のマネキン株式会社'),
(10, '渡辺みり愛', 'わたなべ みりあ', '東京都', '2期', '1999-11-01', '君の名は希望株式会社'),
(11, '衛藤美彩', 'えとう みさ', '大分県', '1期', '1993-01-04', '君の名は希望株式会社'),
(12, '堀未央奈', 'ほり みおな', '岐阜県', '2期', '1996-10-15', '君の名は希望株式会社'),
(13, '斉藤優里', 'さいとう ゆうり', '東京都', '1期', '1993-07-20', '君の名は希望株式会社'),
(14, '井上小百合', 'いのうえ さゆり', '埼玉県', '1期', '1994-12-14', '君の名は希望株式会社'),
(15, '橋本奈々未', 'はしもと ななみ', '北海道', '1期', '1993-02-20', '君の名は希望株式会社'),
(16, '山﨑怜奈', 'やまざき れな', '東京都', '2期', '1997-05-21', '君の名は希望株式会社'),
(17, '北野日奈子', 'きたの ひなこ', '千葉県', '2期', '1996-07-17', '君の名は希望株式会社'),
(18, '松村沙友理', 'まつむら さゆり', '大阪府', '1期', '1992-08-27', '君の名は希望株式会社'),
(19, '和田まあや', 'わだ まあや', '広島県', '1期', '1998-04-23', 'バレッタ株式会社'),
(20, '中元日芽香', 'なかもと ひめか', '広島県', '1期', '1996-04-13', 'バレッタ株式会社'),
(21, '伊藤純奈', 'いとう じゅんな', '神奈川県', '2期', '1998-11-30', 'バレッタ株式会社'),
(22, '桜井玲香', 'さくらい れいか', '神奈川県', '1期', '1994-05-16', 'バレッタ株式会社'),
(23, '川村真洋', 'かわむら まひろ', '大阪府', '1期', '1995-07-23', 'バレッタ株式会社'),
(24, '生駒里奈', 'いこま りな', '秋田県', '1期', '1995-12-29', 'バレッタ株式会社'),
(25, '星野みなみ', 'ほしの みなみ', '千葉県', '1期', '1998-02-06', 'バレッタ株式会社'),
(26, '鈴木絢音', 'すずき あやね', '秋田県', '2期', '1999-03-05', 'バレッタ株式会社'),
(27, '伊藤万理華', 'いとう まりか', '神奈川県', '1期', '1996-02-20', '太陽ノック株式会社'),
(28, '寺田蘭世', 'てらだ らんぜ', '東京都', '2期', '1998-09-23', '太陽ノック株式会社'),
(29, '斎藤ちはる', 'さいとう ちはる', '埼玉県', '1期', '1997-02-17', '太陽ノック株式会社'),
(30, '能條愛未', 'のうじょう あみ', '神奈川県', '1期', '1994-10-18', '太陽ノック株式会社'),
(31, '新内眞衣', 'しんうち まい', '埼玉県', '2期', '1992-01-22', '太陽ノック株式会社'),
(32, '白石麻衣', 'しらいし まい', '群馬県', '1期', '1992-08-20', '太陽ノック株式会社'),
(33, '佐々木琴子', 'ささき ことこ', '埼玉県', '2期', '1998-08-28', '太陽ノック株式会社'),
(34, '齋藤飛鳥', 'さいとう あすか', '東京都', '1期', '1998-08-10', '太陽ノック株式会社'),
(35, '生田絵梨花', 'いくた えりか', '東京都', '1期', '1997-01-22', '太陽ノック株式会社');
